# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, PSA, [1024]] # 10

# Mamba-YOLO PAFPN
head:
  - [ -1, 1, Conv, [ 512, 1, 1 ] ] # 9
  - [ 4, 1, Conv, [ 512, 1, 1 ] ] # 10
  - [ [ -1, 6, -2 ], 1, Zoom_cat, [ ] ]  # 11 cat backbone P4
  - [ -1, 3, AVBlock, [ 256 ] ]  # 12

  - [ -1, 1, Conv, [ 256, 1, 1 ] ] # 13
  - [ 1, 1, Conv, [ 256, 1, 1 ] ] # 14
  - [ [ -1, 4, -2 ], 1, Zoom_cat, [ ] ]  # 15  cat backbone P3
  - [ -1, 3, AVBlock, [ 256 ] ]  # 16 (P3/8-small)

  - [ -1, 1, Conv, [ 256, 3, 2 ] ] # 17
  - [ [ -1, 15 ], 1, SDI, [ ] ]  # 18 cat head P4
  - [ -1, 3, C2f, [ 256 ] ]  # 19 (P4/16-medium)

  - [ -1, 1, Conv, [ 512, 3, 2 ] ] # 20
  - [ [ -1, 11 ], 1, SDI, [ ] ]  # 21 cat head P5
  - [ -1, 3, C2f, [ 512 ] ]  # 22 (P5/32-large)

  - [ [ 4, 6, 10 ], 1, ScalSeq, [ 256 ] ] # 23 args[inchane]
  - [ [ 18, -1 ], 1, attention_model, [ 256 ] ] # 24

  - [[21, 24, 26], 1, v10Detect, [nc]]  # Detect(P3, P4, P5)
